<h2>ОБМЕН И ВОЗВРАТ ПО ЖЕЛАНИЮ ПОКУПАТЕЛЯ</h2>

<p>Если товар по каким-то причинам не подошел вам, вы имеете право вернуть его или обменять на другой в течение 7 дней* с момента покупки при соблюдении следующих условий:</p>

<ul>
    <li>Товар имеет первоначальный вид, имеется товарная кондиция;</li>
    <li>Товар имеет полную комплектацию, включая упаковочные материалы;</li>
    <li>Товар не имеет следов подключался и не имеет признаков монтажа;</li>
    <li>Упаковка товара не имеет повреждений, присутсвует  первоначальный товарный вид;</li>
    <li>Есть документ, подтверждающий покупку в нашем интернет-магазине.</li>
</ul>

<p>Для возврата товара необходимо <strong>привезти его к нам в офис</strong>.</p>
<p>Товар из других городов можно прислать нам транспортной компанией, при этом услуги транспортной компании <strong> оплачиваются клиентом</strong>.</p>
<p>*В течение 14 дней для отдельных брендов. При оформлении заказа уточните у менеджера</p>

<h2>ОБМЕН И ВОЗВРАТ ПО ОШИБКЕ ПРОДАВЦА</h2>
<p>Причины обмена или возврата по ошибке продавца:</p>
<ul>
    <li>Неполная комплектация товара</li>
    <li>Брак или дефект товара</li>
</ul>

<p>Если вы выявили деффект, брак или неполную комплектацию товара, необходимо сделать фото дефекта и отправить  на почту <a href="mailto:info@karta-sveta.ru">info@karta-sveta.ru</a> , указав краткое описание характера брака.</p>
<p>Мы заменим бракованный товар или довезем недостающие части. Доставка будет осуществлена бесплатно</p>

<h2>ВОЗВРАТ ДЕНЕЖНЫХ СРЕДСТВ</h2>
<p>Возврат денежных средств осуществляется путем перевода на банковские  реквизиты покупателя</p>
